#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>
int main()
{
	//1 &&(两边都成立结果才真（1），有一个不成立结果为假（0）)
	printf("%d\n", 1 && 1);//1 两边都是真（1）--两边都成立--结果为真
	printf("%d\n", 0 && 1);//0 有一个假（0），结果也是假
	//2 ||（一边成立结果真，两边都不成立结果假）
	printf("%d\n", 1 || 0);//1
	printf("%d\n", 0 || 0);//0
	// ! 取反，原本真变假，假变真
	printf("%d\n", !1);//0
	/*练习1 键盘录入一个两位整数，要求数字不能有七，且不是7的倍数
	符合要求输出1，不符合要求输出0*/
	int b;
	printf("请输入一个两位整数:");
	scanf("%d", &b);
	//两位数不能有7---个位不是7，十位也不是7--分别用算式取个位和十位的值
	int ge = b % 10;
	int shi = b / 10 % 10;//十位--两位数先除以十再对十取余
	printf("%d\n", ge != 7 && shi != 7 && b % 7!= 0);
	 




	 
}